sm110(icelake)_not_consolidated_4core_4iothread_2/multiplier_16/run10.txt
# run=10/10
# 2026-04-08T00:11:03-05:00
# cmd: taskset -c 1-31 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            744058
        write:                           193026
        other:                           99144
        total:                           1036228
    transactions:                        45997  (766.04 per sec.)
    queries:                             1036228 (17257.48 per sec.)
    ignored errors:                      7150   (119.08 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      766.0402
    time elapsed:                        60.0451s
    total number of events:              45997

Latency (ms):
         min:                                    2.12
         avg:                                   41.75
         max:                                  298.64
         95th percentile:                       89.16
         sum:                              1920509.37

Threads fairness:
    events (avg/stddev):           1437.4062/19.96
    execution time (avg/stddev):   60.0159/0.01